<?php

/*
ex.3 Объявить массив, в котором в качестве ключей будут использоваться названия областей,
а в качестве значений – массивы с названиями городов из соответствующей области.
Вывести в цикле значения массива, чтобы результат был таким:
Московская область:
Москва, Зеленоград, Клин
Ленинградская область:
Санкт-Петербург, Всеволожск, Павловск, Кронштадт
Рязанская область … (названия городов можно найти на maps.yandex.ru)
*/

$cities = [
    'Московская обл.' => ['Москва', 'Зеленоград', 'Клин'],
    'Ленинградская область.' => ['Санкт-Петербург', 'Всеволожск', 'Павловск', 'Кронштадт'],
];

foreach ($cities as $Area => $aCity)
{
    echo(
    "<h2>$Area :</h2>"

    );
    foreach ($aCity as $key => $City)
    {
        echo("$City</br>");
    }

}

?>